#1_ez
"""
t = 1
a = ["яблоко", "банан", "киви", "арбуз"]
z = max([len(i) for i in a])
for i in a:
    print(t, '. ',  '{:>15}'.format(i))
    t += 1
"""
#2
"""
a = ['1', '2', '3', '4']
b = ['5', '6', '1']
for i in a:
    if i in b:
        a.remove(i)
print(a, ' ', b)
"""
#3
"""
a = [1, 2, 3, 4, 5, 6, 7]
for i in range(len(a)):
    if a[i] % 2 == 0:
        a[i] /= 4
    else:
        a[i] *= 2
print(a)
"""

#1_normal
"""
import math
a = [2, -5, 8, 9, -25, 25, 4]
b = []
for i in a:
    if i >= 0 and math.sqrt(i) == int(math.sqrt(i)):
        b.append(int(math.sqrt(i)))
print(b)
"""

#2
"""
a = input()

a = a.split('.')

b = {"01": "Первое", "02": "Второе", "03": "Третье", "04": "Четвертое", "05": "Пятое", "06": "Шестое", "07": "Седьмое", "08": "Восьмое", "09": "Девятое", "10": "Десятое", "11": "Одиннадцатое", "12": "Двенадцатон", "13": "Тринадцатое", "14": "Четырнадцатое", "15": "Пятнадцатое", "16": "Шестнадцатое", "17": "Семнадцатое", "18": "Восемьнадцатое", "19": "Девятнадцатое", "20": "Двадцатое", "21": "Двадцать первое", "22": "Двадцать второе", "23": "Двадцать третье", "24": "Двадцать четвертое", "25": "Двадцать пятое", "26": "Двадцать шестое", "27": "Двадцать седьмое", "28": "Двадцать восьмое", "29": "Двадцать девятое", "30": "Тридцатое", "31": "Тридцать первое"}
mes = {"01": "Января", "02": "Февраля", "03": "Марта", "04": "Апреля", "05": "Мая", "06": "Июня", "07": "Июля", "08": "Августа", "09": "Сентября", "10": "Октября", "11": "Ноября", "12": "Декабря"}
print('{} {} {} {}'.format(b[a[0]], mes[a[1]], a[2], "Года"))
"""

#3
"""
import random
n = int(input())
a = []

for i in range(n):
    a.append(random.randint(-100, 100))
print(a)
"""

#4a
"""
a = ['1', '2', '3', '1', '12']
b = []
for i in a:
    if i not in b:
        b.append(i)
print(b)
"""
#4б
"""
a = ['1', '2', '3', '1', '2', '6']
b = []
for i in range(len(a)):
    if a.count(a[i]) == 1:
        b.append(a[i])
print(b)
"""
#1hard
"""
a = input()
x = int(input())
a = a.split(' ')
a[2] = a[2].strip('x')
if a[3] == "+":
    y = float(a[2]) * x + float(a[-1])
else:
    y = float(a[2]) * x - float(a[-1])
print(y)
"""